Revit 2027 API
Metal.MetalType Property
 The property labeled "Type" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalType { get; }
Public Shared ReadOnly Property MetalType As String
	Get
public:
static property String^ MetalType {
	String^ get ();
}
static member MetalType : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalType".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace